---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.SpeckleSize
source: html/776a43b9-befe-593c-c35f-42c54c13ee8e.htm
---
# Autodesk.Revit.DB.Visual.Speckle.SpeckleSize Property

The property labeled "Size" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string SpeckleSize { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 100".